using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Shapes;

namespace Database
{

    public partial class GuideWindow : Window
    {
        public GuideWindow()
        {
            InitializeComponent();
        }

        private void BackButton_Click(object sender, RoutedEventArgs e)
        {
            MainWindow mainWindow = new MainWindow();
            mainWindow.Show();
            Close();
        }

        private void HowToAdd_Click(object sender, RoutedEventArgs e)
        {
            MessageBox.Show("Щоб додати об'єкт до бази необхідно натиснути на кнопку головного вікна програми \"Додати\". Після чого відкриється вікно додавання об'єкту " +
                "до бази. Поля, що потрібно обов'язково " +
                "заповнити відмічені *. Якщо будь яке з обов'язкових полів буде не заповнене або в поле буде введений неправильний формат " +
                "ви отримаєте повідомлення про це. Як тільки всі необхідні поля заповнені, натисність клавішу додати до бази. Якщо об'єкт " +
                "успішно додано, ви отримаєте повідомлення про це.");
        }

        private void HowToShowData_Click(object sender, RoutedEventArgs e)
        {
            MessageBox.Show("Для того щоб переглянути вміст бази даних необхідно натиснути на кнопку головного вікна програми \"Переглянути\". Після " +
                "чого відкриється вікно " +
                "пергляду доданих до бази об'єктів. Щоб переглянути вміст натисніть на кнопку \"Відобразити дані\". В цьому ж вікні ви можете " +
                "виконати сортування та пошук. Для сортування необхідно вибрати бажані параметри, «Ключ» і «Тип сортування». " +
                "За бажанням можна вказати «Тип транспорту». Після чого натиснути на кнопку \"Фільтрувати та сортувати\". Відфільтровані та відсортовані " +
                "дані з'являться на екрані");
        }

        private void HowToEdit_Click(object sender, RoutedEventArgs e)
        {
            MessageBox.Show("Після натискання кнопки «Редагувати» головного вікна програми, на екрані з’явиться нове вікно, де подвійним " +
                "натисканням мишки по вибраному елементу у ListView можна знайти даний елемент та переглянути, яка інформація про нього була " +
                "введена раніше і замінити бажані значення (рис.11). Редагування здійснюється аналогічно до додавання об’єкта: успішне " +
                "редагування або ж помилки під час внесення змін супроводжуються відповідними повідомленнями");
        }

        private void HowToDelete_Click(object sender, RoutedEventArgs e)
        {
            MessageBox.Show("Щоб вилучити об'єкт із бази даних необхідно натиснути на кнопку головного вікна програми \"Видалити\". " +
                "Після чого відкриється вікно для видалення " +
                "об'єкта. У цьому вікні необхідно вибрати об'єкт який ви бажаєте вилучити та натиснути кнопку \"Видалити з бази\"");
        }

        private void HoToUseAddFunctions_Click(object sender, RoutedEventArgs e)
        {
            MessageBox.Show("В головному вікні програми можна здійснити пошук об’єктів за заданими критеріями. Для пошуку необхідно вибрати значення " +
                "обов’язкових критеріїв «Марка» - шукає автомобілі певної марки, «Рік випску» - шукає машини в заданому діапазоні років випуску, «Пробіг» " +
                "- шукає машини в заданому діапазоні пробігу. Також є кнопки, що виконують фільтрацію: «Відобразити електрокари» " +
                "- виводить тільки електромобілі, «Відобразити спорткари» - відображає тільки автомобілі потужність яких більша 300 кВт.");
        }
    }
}
